USE `vetclinic_db`;

INSERT INTO clients (firstname, lastname, phone) VALUES 
('Илья', 'Коряков', '89991112233'),
('Александр', 'Шеметов', '89992223344'),
('Семен', 'Ильин', '89993334455'),
('Игорь', 'Шерстюк', '89456732998'),
('Кирилл', 'Баранов', '89422442267'),
('Владимир', 'Семенюк', '89231342887'),
('Руслан', 'Тушенцов', '89005689123'),
('Марина', 'Виноградова', '89231285470'),
('Наталья', 'Бердникова', '89403499004'),
('Анна', 'Акулова', '89325432807');

INSERT INTO pets (client_id, name, species, birth_year) VALUES 
(1, 'Завертин', 'Кошка', 2018),
(2, 'Белка', 'Собака', 2022),
(3, 'Боня', 'Кошка', 2016),
(4, 'Мурка', 'Кошка', 2017),
(5, 'Хвостик', 'Крыса', 2025),
(5, 'Пятнышко', 'Крыса', 2023),
(5, 'Патрик', 'Крыса', 2024),
(5, 'Пират', 'Крыса', 2024),
(6, 'Алина', 'Змея', 2018),
(7, 'Бензопила', 'Собака', 2016),
(8, 'Степа', 'Хомяк', 2026),
(8, 'Шафран', 'Собака', 2020),
(9, 'Сэм', 'Кошка', 2019),
(9, 'Андрей', 'Кролик', 2025),
(10, 'Кореш', 'Попугай', 2021),
(10, 'Платон', 'Змея', 2023);

INSERT INTO doctors (firstname, lastname, specialization) VALUES 
('Катерина', 'Лютикова', 'Терапевт'),
('Роман', 'Фильченков', 'Терапевт'),
('Мария', 'Сурова', 'Хирург'),
('Александр', 'Суворов', 'Хирург'),
('Олег', 'Воробьев', 'Ортопед'),
('Валентин', 'Курносов', 'Стоматолог'),
('Илья', 'Башаров', 'Кардиолог');

INSERT INTO services (name, cost) VALUES 
('Первичный осмотр', 1000.00),
('Повторный осмотр', 600.00),
('Вакцинация (комплексная)', 1500.00),
('УЗИ брюшной полости', 2000.00),
('Рентген', 1200.00),
('Кастрация / Стерилизация котов/кошек', 3500.00),
('Кастрация / Стерилизация собак', 8000.00),
('Санация ротовой полости', 2500.00),
('Общий клинический анализ крови', 800.00),
('Прием ортопеда и наложение лангеты', 4500.00),
('ЭКГ (Электрокардиограмма)', 1800.00);

INSERT INTO appointments (pet_id, doctor_id, service_id, appointment_date, status) VALUES 
(1, 1, 3, '2025-05-10 10:00:00', 'Выполнен'),
(10, 5, 10, '2025-08-15 14:00:00', 'Выполнен'),
(10, 5, 5, '2025-08-25 15:30:00', 'Выполнен'),
(3, 3, 6, '2025-11-05 11:00:00', 'Выполнен'),
(13, 6, 8, '2025-12-10 12:00:00', 'Выполнен'),
(2, 4, 7, '2026-01-15 09:00:00', 'Выполнен'),
(9, 2, 1, '2026-02-20 16:00:00', 'Выполнен'),
(15, 2, 9, '2026-03-10 13:15:00', 'Выполнен'),
(12, 7, 11, '2026-04-05 17:00:00', 'Выполнен'),
(12, 7, 2, '2026-04-12 10:00:00', 'Отменен'),
(6, 1, 1, '2026-05-01 11:00:00', 'Выполнен'),
(7, 1, 1, '2026-05-01 11:30:00', 'Выполнен'),
(4, 3, 4, '2026-05-15 14:45:00', 'Выполнен'),
(11, 1, 1, '2026-06-01 18:00:00', 'Выполнен'),
(14, 4, 5, '2026-06-05 10:20:00', 'Выполнен'),
(16, 2, 1, '2026-06-10 09:30:00', 'Отменен'),
(8, 1, 9, '2026-06-18 09:00:00', 'Запланирован'),
(10, 5, 10, '2026-06-22 14:00:00', 'Запланирован'),
(12, 7, 11, '2026-06-25 11:00:00', 'Запланирован'),
(5, 6, 8, '2026-07-02 15:00:00', 'Запланирован'),
(1, 1, 3, '2026-07-05 10:00:00', 'Запланирован');